Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/the_irish_education_system/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Overview of the Irish education system The Irish education system is made up of first, second and third-level education and of further education
ga: Overview Document Forléargas ar chóras oideachais na hÉireann Cuimsíonn córas oideachais na hÉireann oideachas chéad, dara agus tríú leibhéal agus breisoideachas

source: Almost all education is funded by the State
ga: Tá beagnach gach oideachas maoinithe ag an Stát

source: The Irish Constitution (Bunreacht na hÉireann) contains specific articles on education, religion, and the family, which affect how education is organised
ga: Tá cur síos anseo ar na hAirteagail de Bhunreacht na hÉireann a bhaineann le hoideachas, le creideamh agus leis an teaghlach agus an tionchar atá acu ar an gcóras oideachais

source: There are arrangements and conditions for exempting certain students from the study of Irish in post-primary school and in certificate examinations at post-primary level
ga: Tá cur síos anseo ar na socruithe agus coinníollacha a bhaineann le díolúine ón nGaeilge atá ar fáil do scoláirí áirithe in iarbhunscoileanna agus i scrúdaithe iarbhunscoileanna

source: This document describes the special arrangements for the education of children with special educational needs
ga: Déanann an doiciméad seo cur síos ar na socruithe speisialta d’oideachas leanaí a bhfuil riachtanais speisialta oideachais acu

source: Teaching your child at home
ga: Do leanbh a mhúineadh sa bhaile

source: Information on the rights of parents to educate their children at home and how home education is regulated and assessed
ga: Faisnéis maidir le cearta tuismitheoirí chun oideachas a chur ar a gcuid leanaí sa bhaile agus maidir leis an gcaoi a dhéantar oideachas sa bhaile a rialú agus a mheasúnú

source: Organisations such as parents' associations, parents' councils and other agencies provide parents with support and information about their children's education
ga: Cuireann eagraíochtaí ar nós cumann tuismitheoirí, comhairlí tuismitheoirí agus gníomhaireachtaí eile tacaíocht agus faisnéis ar fáil do thuismitheoirí faoi oideachas a leanaí

source: Measures to address educational disadvantage
ga: Bearta le dul i ngleic le míbhuntáiste oideachasúil

source: Delivering Equality of Opportunity in Schools (DEIS) and other initiatives provide supports to address educational disadvantage
ga: Soláthraíonn 'Ag Soláthar Comhdheiseanna i Scoileanna' (SCS) agus tionscadail eile tacaíochtaí chun dul i ngleic le míbhuntáiste oideachasúil

source: Most Read in "Education and Training"
ga: Ábhar is mó éilimh i "Oideachas agus Oiliúint"

source: School terms in primary and post-primary schools
ga: Téarmaí scoile i mbunscoileanna agus iarbhunscoileanna

source: Further Education and Training (FET) allowances
ga: Liúntais Bhreisoideachais agus Oiliúna (BOO)
